config.org
#+TITLE: CONFIG
* user vars
#+BEGIN_SRC emacs-lisp
(setq user-full-name "Wong Ding Feng"
      user-mail-address "dfwong5566@gmail.com")
#+END_SRC
* use-package
#+BEGIN_SRC emacs-lisp
  (require 'package)
  (add-to-list 'package-archives
	       '("org" . "http://orgmode.org/elpa/") t)
  (add-to-list 'package-archives
	       '("melpa" . "https://melpa.org/packages/") t)
  (add-to-list 'package-archives
	       '("org" . "https://orgmode.org/elpa/") t)

  (package-initialize)
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t)

  ;;Always demand if daemon-mode
  ;;(setq use-package-always-demand (daemonp))
#+END_SRC
* conunsel
  #+BEGIN_SRC emacs-lisp :results none
    (use-package counsel)
  #+END_SRC
* ivy
#+BEGIN_SRC emacs-lisp
  (use-package ivy
    :ensure counsel
    :config 
    (ivy-mode 1)
    (setq ivy-use-virtual-buffers t)
    (setq enable-recursive-minibuffers t)
    (global-set-key "\C-s" 'swiper)
    (global-set-key (kbd "C-c C-r") 'ivy-resume)
    (global-set-key (kbd "<f6>") 'ivy-resume)
    (global-set-key (kbd "M-x") 'counsel-M-x)
    (global-set-key (kbd "C-x C-f") 'counsel-find-file)
    (global-set-key (kbd "<f1> f") 'counsel-describe-function)
    (global-set-key (kbd "<f1> v") 'counsel-describe-variable)
    (global-set-key (kbd "<f1> l") 'counsel-find-library)
    (global-set-key (kbd "<f2> i") 'counsel-info-lookup-symbol)
    (global-set-key (kbd "<f2> u") 'counsel-unicode-char)
    (global-set-key (kbd "C-c g") 'counsel-git)
    (global-set-key (kbd "C-c j") 'counsel-git-grep)
    (global-set-key (kbd "C-c k") 'counsel-ag)
    (global-set-key (kbd "C-x l") 'counsel-locate)
    (global-set-key (kbd "C-S-o") 'counsel-rhythmbox)
    (define-key minibuffer-local-map (kbd "C-r") 'counsel-minibuffer-history))
#+END_SRC
* which-key
  #+BEGIN_SRC emacs-lisp :results none
    (use-package which-key
      :ensure t
      :config
      (which-key-mode)
      (setq which-key-idle-delay 0.1))
  #+END_SRC
* moe-theme
  #+BEGIN_SRC emacs-lisp :results none
    (use-package moe-theme
      :ensure t
      :config
      (moe-dark))
  #+END_SRC
* yp
  #+BEGIN_SRC emacs-lisp
    (defalias 'yes-or-no-p 'y-or-n-p)
  #+END_SRC
* littering
  #+BEGIN_SRC emacs-lisp
    (use-package no-littering
      :config
      (require 'recentf)
      (add-to-list 'recentf-exclude no-littering-var-directory)
      (add-to-list 'recentf-exclude no-littering-etc-directory)
      :config
      (setq auto-save-file-name-transforms
	    `((".*" ,(no-littering-expand-var-file-name "auto-save/") t))))
  #+END_SRC
* auto-save-mode
  #+BEGIN_SRC emacs-lisp :results none
    (use-package super-save
      :config
      (super-save-mode 1))
  #+END_SRC
* lock
  #+BEGIN_SRC emacs-lisp
    (setq create-lockfiles nil)
  #+END_SRC
* pdf-tools
  #+BEGIN_SRC emacs-lisp :results none
    (use-package pdf-tools) 
  #+END_SRC
* org
  #+BEGIN_SRC emacs-lisp
    (add-to-list 'org-modules 'org-drill)
    (use-package org
      :ensure org-plus-contrib
      :config
      (plist-put org-format-latex-options :scale 2.5)
      (org-babel-do-load-languages
	'org-babel-load-languages
	'((dot . t))))
  #+END_SRC
