config.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>CONFIG</title>
<meta name="author" content="Wong Ding Feng"/>
<link rel="stylesheet" href="./reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="./reveal.js/css/theme/moon.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide">
<h1 class="title">CONFIG</h1><h2 class="author">Wong Ding Feng</h2><p class="date">Created: 2019-03-22 Fri 14:33</p>
</section>
<section id="table-of-contents-section">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#/slide-orgc34dedc">1. user vars</a></li>
<li><a href="#/slide-orgf85a573">2. use-package</a></li>
<li><a href="#/slide-orge1aee6a">3. conunsel</a></li>
<li><a href="#/slide-orgdeb28d7">4. ivy</a></li>
<li><a href="#/slide-orgf0ca42f">5. which-key</a></li>
<li><a href="#/slide-org2f1619a">6. moe-theme</a></li>
<li><a href="#/slide-orgdaa2021">7. yp</a></li>
<li><a href="#/slide-org89552bb">8. littering</a></li>
<li><a href="#/slide-orgf208fc4">9. auto-save-mode</a></li>
<li><a href="#/slide-org5c737b3">10. lock</a></li>
<li><a href="#/slide-orgc0ffe05">11. pdf-tools</a></li>
<li><a href="#/slide-org2683241">12. org</a>
<ul>
<li><a href="#/slide-org21122d0">12.1. org-drill</a></li>
<li><a href="#/slide-org4e06341">12.2. org-ref</a></li>
</ul>
</li>
<li><a href="#/slide-orgf6e610f">13. menu bar mode</a></li>
<li><a href="#/slide-org2b96896">14. yasnippet</a></li>
<li><a href="#/slide-org3db585e">15. evil</a></li>
<li><a href="#/slide-orgb59f838">16. autosave</a></li>
<li><a href="#/slide-org551e75f">17. google this</a></li>
<li><a href="#/slide-org5661215">18. Auto all</a></li>
<li><a href="#/slide-orgf80053a">19. compnay mode</a></li>
<li><a href="#/slide-org53fa3bb">20. config</a></li>
<li><a href="#/slide-orgeade0c8">21. smart parens</a></li>
<li><a href="#/slide-org491075e">22. counsel-projectile</a></li>
<li><a href="#/slide-org4cb9cfb">23. projectile</a></li>
<li><a href="#/slide-orgb7865b5">24. lsp</a></li>
<li><a href="#/slide-org9563480">25. company-lsp</a></li>
<li><a href="#/slide-org3c22bfa">26. lsp-ui</a></li>
<li><a href="#/slide-org8ec33f9">27. ccls-cquery</a></li>
<li><a href="#/slide-org43f5ba6">28. flycheck</a></li>
<li><a href="#/slide-orgd1efafe">29. ripgrep</a></li>
<li><a href="#/slide-org7743e37">30. magit</a></li>
<li><a href="#/slide-orgfa3f2e8">31. jumps</a>
<ul>
<li><a href="#/slide-org3e28190">31.1. dumb jump</a></li>
<li><a href="#/slide-org6853b00">31.2. jump</a></li>
</ul>
</li>
<li><a href="#/slide-orgec52727">32. dashboard</a></li>
<li><a href="#/slide-orgd8ff4b2">33. pdf</a></li>
<li><a href="#/slide-org1047864">34. dot</a></li>
<li><a href="#/slide-orgb6572e6">35. tabs</a></li>
<li><a href="#/slide-orge835aea">36. simple<sub>SRC</sub></a></li>
<li><a href="#/slide-orgaa15f60">37. pql</a></li>
<li><a href="#/slide-org689cd09">38. wgrep</a></li>
<li><a href="#/slide-org721b205">39. base16</a></li>
<li><a href="#/slide-org0db8b22">40. transparency</a></li>
<li><a href="#/slide-orge9cff44">41. nix</a>
<ul>
<li><a href="#/slide-orgc541ded">41.1. nixos-options</a></li>
<li><a href="#/slide-orge205445">41.2. nix mode</a></li>
</ul>
</li>
<li><a href="#/slide-orge92804f">42. undo tree</a></li>
<li><a href="#/slide-orge00d012">43. smart jump</a></li>
<li><a href="#/slide-org3bff123">44. beacon mode</a></li>
<li><a href="#/slide-orgb6a5c72">45. rainbow delimitters</a></li>
<li><a href="#/slide-org0c78fac">46. avy</a></li>
<li><a href="#/slide-orgb0a19ec">47. treemacs</a></li>
<li><a href="#/slide-org6fc27a5">48. python</a>
<ul>
<li><a href="#/slide-orge3c4cae">48.1. jedi</a></li>
</ul>
</li>
<li><a href="#/slide-org38bd030">49. company jedi</a></li>
<li><a href="#/slide-orgc9bd48e">50. rainbow mode</a></li>
<li><a href="#/slide-orgdf49de0">51. python</a>
<ul>
<li><a href="#/slide-org2c0aefd">51.1. alist</a></li>
<li><a href="#/slide-orgb555359">51.2. ein</a></li>
</ul>
</li>
<li><a href="#/slide-orgbe3a9b2">52. hl-todo</a></li>
<li><a href="#/slide-org8536b7f">53. center cursor</a></li>
<li><a href="#/slide-org1f9c59a">54. reveal.js</a></li>
</ul>
</div>
</div>
</section>
<section>
<section id="slide-orgc34dedc">
<h2 id="orgc34dedc"><span class="section-number-2">1</span> user vars</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">setq</span> user-full-name <span style="color: #ffa07a;">"Wong Ding Feng"</span>
      user-mail-address <span style="color: #ffa07a;">"dfwong5566@gmail.com"</span>)
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgf85a573">
<h2 id="orgf85a573"><span class="section-number-2">2</span> use-package</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">require</span> '<span style="color: #7fffd4;">package</span>)
(add-to-list 'package-archives
       '(<span style="color: #ffa07a;">"org"</span> . <span style="color: #ffa07a;">"http://orgmode.org/elpa/"</span>) t)
(add-to-list 'package-archives
       '(<span style="color: #ffa07a;">"melpa"</span> . <span style="color: #ffa07a;">"https://melpa.org/packages/"</span>) t)
(add-to-list 'package-archives
       '(<span style="color: #ffa07a;">"org"</span> . <span style="color: #ffa07a;">"https://orgmode.org/elpa/"</span>) t)

(package-initialize)
(<span style="color: #00ffff;">unless</span> (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(<span style="color: #00ffff;">require</span> '<span style="color: #7fffd4;">use-package</span>)
(<span style="color: #00ffff;">setq</span> use-package-always-ensure t)

<span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">Always demand if daemon-mode</span>
<span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">(setq use-package-always-demand (daemonp))</span>
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orge1aee6a">
<h2 id="orge1aee6a"><span class="section-number-2">3</span> conunsel</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">counsel</span>)
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgdeb28d7">
<h2 id="orgdeb28d7"><span class="section-number-2">4</span> ivy</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">ivy</span>
  <span style="color: #b0c4de;">:ensure</span> counsel
  <span style="color: #b0c4de;">:config</span> 
  (ivy-mode 1)
  (<span style="color: #00ffff;">setq</span> ivy-use-virtual-buffers t)
  (<span style="color: #00ffff;">setq</span> enable-recursive-minibuffers t)
  (global-set-key <span style="color: #ffa07a;">"\C-s"</span> 'swiper)
  (global-set-key (kbd <span style="color: #ffa07a;">"C-c C-r"</span>) 'ivy-resume)
  (global-set-key (kbd <span style="color: #ffa07a;">"&lt;f6&gt;"</span>) 'ivy-resume)
  (global-set-key (kbd <span style="color: #ffa07a;">"M-x"</span>) 'counsel-M-x)
  (global-set-key (kbd <span style="color: #ffa07a;">"C-x C-f"</span>) 'counsel-find-file)
  (global-set-key (kbd <span style="color: #ffa07a;">"&lt;f1&gt; f"</span>) 'counsel-describe-function)
  (global-set-key (kbd <span style="color: #ffa07a;">"&lt;f1&gt; v"</span>) 'counsel-describe-variable)
  (global-set-key (kbd <span style="color: #ffa07a;">"&lt;f1&gt; l"</span>) 'counsel-find-library)
  (global-set-key (kbd <span style="color: #ffa07a;">"&lt;f2&gt; i"</span>) 'counsel-info-lookup-symbol)
  (global-set-key (kbd <span style="color: #ffa07a;">"&lt;f2&gt; u"</span>) 'counsel-unicode-char)
  (global-set-key (kbd <span style="color: #ffa07a;">"C-c g"</span>) 'counsel-git)
  (global-set-key (kbd <span style="color: #ffa07a;">"C-c j"</span>) 'counsel-git-grep)
  (global-set-key (kbd <span style="color: #ffa07a;">"C-c k"</span>) 'counsel-ag)
  (global-set-key (kbd <span style="color: #ffa07a;">"C-x l"</span>) 'counsel-locate)
  (global-set-key (kbd <span style="color: #ffa07a;">"C-S-o"</span>) 'counsel-rhythmbox)
  (define-key minibuffer-local-map (kbd <span style="color: #ffa07a;">"C-r"</span>) 'counsel-minibuffer-history))
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgf0ca42f">
<h2 id="orgf0ca42f"><span class="section-number-2">5</span> which-key</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">which-key</span>
  <span style="color: #b0c4de;">:ensure</span> t
  <span style="color: #b0c4de;">:config</span>
  (which-key-mode)
  (<span style="color: #00ffff;">setq</span> which-key-idle-delay 0.1))
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org2f1619a">
<h2 id="org2f1619a"><span class="section-number-2">6</span> moe-theme</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">moe-theme</span>
  <span style="color: #b0c4de;">:ensure</span> t
  <span style="color: #b0c4de;">:config</span>
  (moe-dark))
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgdaa2021">
<h2 id="orgdaa2021"><span class="section-number-2">7</span> yp</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">defalias</span> '<span style="color: #87cefa;">yes-or-no-p</span> 'y-or-n-p)
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org89552bb">
<h2 id="org89552bb"><span class="section-number-2">8</span> littering</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">no-littering</span>
  <span style="color: #b0c4de;">:config</span>
  (<span style="color: #00ffff;">require</span> '<span style="color: #7fffd4;">recentf</span>)
  (add-to-list 'recentf-exclude no-littering-var-directory)
  (add-to-list 'recentf-exclude no-littering-etc-directory)
  <span style="color: #b0c4de;">:config</span>
  (<span style="color: #00ffff;">setq</span> auto-save-file-name-transforms
  `((<span style="color: #ffa07a;">".*"</span> ,(no-littering-expand-var-file-name <span style="color: #ffa07a;">"auto-save/"</span>) t))))
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgf208fc4">
<h2 id="orgf208fc4"><span class="section-number-2">9</span> auto-save-mode</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">super-save</span>
  <span style="color: #b0c4de;">:config</span>
  (super-save-mode 1))
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org5c737b3">
<h2 id="org5c737b3"><span class="section-number-2">10</span> lock</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">setq</span> create-lockfiles nil)
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgc0ffe05">
<h2 id="orgc0ffe05"><span class="section-number-2">11</span> pdf-tools</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">pdf-tools</span>) 
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org2683241">
<h2 id="org2683241"><span class="section-number-2">12</span> org</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">  (add-to-list 'org-modules 'org-drill)
  (<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">org</span>
    <span style="color: #b0c4de;">:ensure</span> org-plus-contrib
    <span style="color: #b0c4de;">:config</span>
    (plist-put org-format-latex-options <span style="color: #b0c4de;">:scale</span> 2.5)
    (org-babel-do-load-languages
'org-babel-load-languages
'((dot . t))))
</pre>
</div>
</section>
