config.org
** org-drill
   #+BEGIN_SRC emacs-lisp :results none
     ;;(load "/home/df/.emacs.d.df/elpa/org-plus-contrib-20190225/org-drill.el")
     (use-package org-drill
       :load-path "/home/df/.emacs.d.df/elpa/org-plus-contrib-20190225/org-drill.el"
       :defer t 
       :ensure org-plus-contrib)
   #+END_SRC
** org-ref
   #+BEGIN_SRC emacs-lisp :results none
     (use-package org-ref
       :config
       (setq reftex-default-bibliography '("~/df/org/ref/master.bib"))
       (setq org-ref-bibliography-notes "~/df/org/ref/notes.org"
	     org-ref-default-bibliography '("~/df/org/ref/master.bib")
	     org-ref-pdf-directory "~/df/org/ref/pdfs/"))
       ;;(setq bibtex-completion-bibliography "~/df/org/ref/master.bib"
       ;;	     bibtex-completion-library-path "~/df/org/ref/pdfs/"
  ;;	     bibtex-completion-notes-path "~/df/org/ref/notes.org"))
   #+END_SRC
* menu bar mode
  #+BEGIN_SRC emacs-lisp
    (menu-bar-mode -1)
    (tool-bar-mode -1)
    (scroll-bar-mode -1)
  #+END_SRC
* yasnippet
  #+BEGIN_SRC emacs-lisp
    (use-package yasnippet
      :config
      (yas-global-mode 1))
  #+END_SRC
* evil
  #+BEGIN_SRC emacs-lisp :results none
    (use-package evil
      :bind
      (:map evil-insert-state-map
            ("C-x C-f" . company-files))
      :config
      (evil-mode 1))
  #+END_SRC
* autosave
  #+BEGIN_SRC emacs-lisp :results none
    (defun save-all ()
      (interactive)
      (save-some-buffers t))

    (add-hook 'focus-out-hook 'save-all)
  #+END_SRC
* google this
  #+BEGIN_SRC emacs-lisp :results none
    (use-package google-this
      :config
      (google-this-mode 1))
  #+END_SRC
* Auto all 
  #+BEGIN_SRC emacs-lisp :results none
    (add-hook 'text-mode-hook 'turn-on-auto-fill)
  #+END_SRC
* compnay mode
  #+BEGIN_SRC emacs-lisp :results none
    (use-package company
      :bind
      (:map comint-mode-map
        ("<tab>" . company-complete-common))
      :config
      (global-company-mode)
      (setq company-ispell-dictionary (expand-file-name "./words_alpha.txt" user-emacs-directory)))
  #+END_SRC
* config
  #+BEGIN_SRC emacs-lisp :results none
    (use-package evil-surround
      :config
      (global-evil-surround-mode 1))
  #+END_SRC
* smart parens
  #+BEGIN_SRC emacs-lisp :results none
    (use-package smartparens
      :config
      (require 'smartparens-config)
      (sp-pair "$" "$") 
      (show-smartparens-global-mode 1)
      (smartparens-global-mode 1))
  #+END_SRC
* counsel-projectile
  #+BEGIN_SRC emacs-lisp :results none
    (use-package counsel-projectile
      :bind-keymap
      ("C-c p" . projectile-command-map))
  #+END_SRC
* projectile
  #+BEGIN_SRC emacs-lisp results none
    (use-package projectile
      :ensure counsel-projectile
      :bind-keymap
      ("C-c p" . projectile-command-map)) 
  #+END_SRC
* lsp
  #+BEGIN_SRC emacs-lisp :results none
    (use-package lsp-mode) 
  #+END_SRC
* company-lsp
  #+BEGIN_SRC emacs-lisp :results none
    (use-package company-lsp) 
  #+END_SRC
* lsp-ui
  #+BEGIN_SRC emacs-lisp :results none
    (use-package lsp-ui) 
  #+END_SRC
* ccls-cquery
  #+BEGIN_SRC emacs-lisp :results none
    (use-package ccls)
  #+END_SRC
* flycheck
  #+BEGIN_SRC emacs-lisp :results none
    (use-package flycheck) 
  #+END_SRC
* ripgrep
  #+BEGIN_SRC emacs-lisp :results none
    (use-package ripgrep)
  #+END_SRC
* magit
  #+BEGIN_SRC emacs-lisp :results none
    (use-package magit)
  #+END_SRC
* jumps
** dumb jump
   #+BEGIN_SRC emacs-lisp :results none
     (use-package dumb-jump)
   #+END_SRC
** jump
   #+BEGIN_SRC emacs-lisp :results none
     (use-package ace-jump-mode)
   #+END_SRC
* dashboard
  #+BEGIN_SRC emacs-lisp :results none
    (use-package dashboard
      :config
      (setq dashboard-items '((recents  . 5)
			      (bookmarks . 5)
			      (projects . 5)
			      (agenda . 5)
			      (registers . 5)))
      (dashboard-setup-startup-hook)) 
  #+END_SRC
* pdf
  #+BEGIN_SRC emacs-lisp :results none
    (use-package pdf-tools) 
  #+END_SRC
* dot
  #+BEGIN_SRC emacs-lisp :results none
    (use-package dot-mode)
    (use-package graphviz-dot-mode)
  #+END_SRC
