config.html
<section id="slide-org21122d0">
<h3 id="org21122d0"><span class="section-number-3">12.1</span> org-drill</h3>
<div class="org-src-container">

<pre  class="src src-emacs-lisp"><span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">(load "/home/df/.emacs.d.df/elpa/org-plus-contrib-20190225/org-drill.el")</span>
(<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">org-drill</span>
  <span style="color: #b0c4de;">:load-path</span> <span style="color: #ffa07a;">"/home/df/.emacs.d.df/elpa/org-plus-contrib-20190225/org-drill.el"</span>
  <span style="color: #b0c4de;">:defer</span> t 
  <span style="color: #b0c4de;">:ensure</span> org-plus-contrib)
</pre>
</div>
</section>
<section id="slide-org4e06341">
<h3 id="org4e06341"><span class="section-number-3">12.2</span> org-ref</h3>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">   (<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">org-ref</span>
     <span style="color: #b0c4de;">:config</span>
     (<span style="color: #00ffff;">setq</span> reftex-default-bibliography '(<span style="color: #ffa07a;">"~/df/org/ref/master.bib"</span>))
     (<span style="color: #00ffff;">setq</span> org-ref-bibliography-notes <span style="color: #ffa07a;">"~/df/org/ref/notes.org"</span>
     org-ref-default-bibliography '(<span style="color: #ffa07a;">"~/df/org/ref/master.bib"</span>)
     org-ref-pdf-directory <span style="color: #ffa07a;">"~/df/org/ref/pdfs/"</span>))
     <span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">(setq bibtex-completion-bibliography "~/df/org/ref/master.bib"</span>
     <span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">      bibtex-completion-library-path "~/df/org/ref/pdfs/"</span>
<span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">       bibtex-completion-notes-path "~/df/org/ref/notes.org"))</span>
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgf6e610f">
<h2 id="orgf6e610f"><span class="section-number-2">13</span> menu bar mode</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org2b96896">
<h2 id="org2b96896"><span class="section-number-2">14</span> yasnippet</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">yasnippet</span>
  <span style="color: #b0c4de;">:config</span>
  (yas-global-mode 1))
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org3db585e">
<h2 id="org3db585e"><span class="section-number-2">15</span> evil</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">evil</span>
  <span style="color: #b0c4de;">:bind</span>
  (<span style="color: #b0c4de;">:map</span> evil-insert-state-map
        (<span style="color: #ffa07a;">"C-x C-f"</span> . company-files))
  <span style="color: #b0c4de;">:config</span>
  (evil-mode 1))
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgb59f838">
<h2 id="orgb59f838"><span class="section-number-2">16</span> autosave</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">save-all</span> ()
  (<span style="color: #00ffff;">interactive</span>)
  (save-some-buffers t))

(add-hook 'focus-out-hook 'save-all)
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org551e75f">
<h2 id="org551e75f"><span class="section-number-2">17</span> google this</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">google-this</span>
  <span style="color: #b0c4de;">:config</span>
  (google-this-mode 1))
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org5661215">
<h2 id="org5661215"><span class="section-number-2">18</span> Auto all</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(add-hook 'text-mode-hook 'turn-on-auto-fill)
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgf80053a">
<h2 id="orgf80053a"><span class="section-number-2">19</span> compnay mode</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">company</span>
  <span style="color: #b0c4de;">:bind</span>
  (<span style="color: #b0c4de;">:map</span> comint-mode-map
    (<span style="color: #ffa07a;">"&lt;tab&gt;"</span> . company-complete-common))
  <span style="color: #b0c4de;">:config</span>
  (global-company-mode)
  (<span style="color: #00ffff;">setq</span> company-ispell-dictionary (expand-file-name <span style="color: #ffa07a;">"./words_alpha.txt"</span> user-emacs-directory)))
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org53fa3bb">
<h2 id="org53fa3bb"><span class="section-number-2">20</span> config</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">evil-surround</span>
  <span style="color: #b0c4de;">:config</span>
  (global-evil-surround-mode 1))
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgeade0c8">
<h2 id="orgeade0c8"><span class="section-number-2">21</span> smart parens</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">smartparens</span>
  <span style="color: #b0c4de;">:config</span>
  (<span style="color: #00ffff;">require</span> '<span style="color: #7fffd4;">smartparens-config</span>)
  (sp-pair <span style="color: #ffa07a;">"$"</span> <span style="color: #ffa07a;">"$"</span>) 
  (show-smartparens-global-mode 1)
  (smartparens-global-mode 1))
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org491075e">
<h2 id="org491075e"><span class="section-number-2">22</span> counsel-projectile</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">counsel-projectile</span>
  <span style="color: #b0c4de;">:bind-keymap</span>
  (<span style="color: #ffa07a;">"C-c p"</span> . projectile-command-map))
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org4cb9cfb">
<h2 id="org4cb9cfb"><span class="section-number-2">23</span> projectile</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">projectile</span>
  <span style="color: #b0c4de;">:ensure</span> counsel-projectile
  <span style="color: #b0c4de;">:bind-keymap</span>
  (<span style="color: #ffa07a;">"C-c p"</span> . projectile-command-map)) 
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgb7865b5">
<h2 id="orgb7865b5"><span class="section-number-2">24</span> lsp</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">lsp-mode</span>) 
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org9563480">
<h2 id="org9563480"><span class="section-number-2">25</span> company-lsp</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">company-lsp</span>) 
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org3c22bfa">
<h2 id="org3c22bfa"><span class="section-number-2">26</span> lsp-ui</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">lsp-ui</span>) 
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org8ec33f9">
<h2 id="org8ec33f9"><span class="section-number-2">27</span> ccls-cquery</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">ccls</span>)
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org43f5ba6">
<h2 id="org43f5ba6"><span class="section-number-2">28</span> flycheck</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">flycheck</span>) 
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgd1efafe">
<h2 id="orgd1efafe"><span class="section-number-2">29</span> ripgrep</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">ripgrep</span>)
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org7743e37">
<h2 id="org7743e37"><span class="section-number-2">30</span> magit</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">magit</span>)
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgfa3f2e8">
<h2 id="orgfa3f2e8"><span class="section-number-2">31</span> jumps</h2>
<div class="outline-text-2" id="text-31">
</div>
</section>
<section id="slide-org3e28190">
<h3 id="org3e28190"><span class="section-number-3">31.1</span> dumb jump</h3>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">dumb-jump</span>)
</pre>
</div>
</section>
<section id="slide-org6853b00">
<h3 id="org6853b00"><span class="section-number-3">31.2</span> jump</h3>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">ace-jump-mode</span>)
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgec52727">
<h2 id="orgec52727"><span class="section-number-2">32</span> dashboard</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">dashboard</span>
  <span style="color: #b0c4de;">:config</span>
  (<span style="color: #00ffff;">setq</span> dashboard-items '((recents  . 5)
        (bookmarks . 5)
        (projects . 5)
        (agenda . 5)
        (registers . 5)))
  (dashboard-setup-startup-hook)) 
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgd8ff4b2">
<h2 id="orgd8ff4b2"><span class="section-number-2">33</span> pdf</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">pdf-tools</span>) 
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org1047864">
<h2 id="org1047864"><span class="section-number-2">34</span> dot</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">dot-mode</span>)
(<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">graphviz-dot-mode</span>)
</pre>
</div>
</section>
</section>
