config.org
* tabs
  #+BEGIN_SRC emacs-lisp :results none
    (setq-default indent-tabs-mode nil)
    (setq-default tab-width 2)
    (setq indent-line-function 'insert-tab)
    (setq tab-stop-list (number-sequence 2 200 2))
  #+END_SRC
* simple_SRC
  #+BEGIN_SRC emacs-lisp :results none
    (require 'generic-x) ;; we need this
    (define-generic-mode 
          'simple-mode                         ;; name of the mode to create
          '("!!")                           ;; comments start with '!!'
          '("procedure" "read" "call" "if" "else")                     ;; some keywords
          '(("=" . 'font-lock-operator)     ;; '=' is an operator
            (";" . 'font-lock-builtin))     ;; ';' is a built-in 
          '("\\.simple$")                      ;; files for which to activate this mode 
           nil                              ;; other functions to call
          "A mode for simple files"            ;; doc string for this mode
        )
  #+END_SRC
* pql
  #+BEGIN_SRC emacs-lisp :results none
    (require 'generic-x) ;; we need this
    (define-generic-mode 
          'pql-mode                         ;; name of the mode to create
          '("#")                           ;; comments start with '!!'
          '("program" "procedure" "stmt" "assign"
          "call" "while" "if" "read" "print"
          "variable" "then else" "and" "Select" "such that" "Calls" "Next" "Affects"
          "Uses" "UsesS" "UsesP" "Modifies" "ModifiesS" "ModifiesP")
          '(("=" . 'font-lock-operator)     ;; '=' is an operator
            (";" . 'font-lock-builtin))     ;; ';' is a built-in 
          '("\\.simple$")                      ;; files for which to activate this mode 
           nil                              ;; other functions to call
          "A mode for simple files"            ;; doc string for this mode
        )
  #+END_SRC
* wgrep
  #+BEGIN_SRC emacs-lisp :results none
    (use-package wgrep) 
  #+END_SRC
* base16
  #+BEGIN_SRC emacs-lisp :results none
    (defun refresh-theme ()
      (interactive)
      (progn
        (mapc #'disable-theme custom-enabled-themes)
        (load-theme 'base16 t))) 

    (use-package base16-theme
      :init
      :config
      (mapc #'disable-theme custom-enabled-themes)
      (load-theme 'base16-solarized-dark t)
      (mapc #'disable-theme custom-enabled-themes))
      ;;(load-theme 'base16 t))
  #+END_SRC
* transparency
  #+BEGIN_SRC emacs-lisp :results none
    (set-frame-parameter (selected-frame) 'alpha '(95 . 85)) 
    (add-to-list 'default-frame-alist '(alpha . (95 . 85)))
  #+END_SRC
* nix
** nixos-options
   #+BEGIN_SRC emacs-lisp :results none
     (use-package nixos-options)
   #+END_SRC
*** COMMENT company
    #+BEGIN_SRC emacs-lisp :results none
      (use-package company-nixos-options
        :config
        (add-to-list 'company-backends 'company-nixos-options))
    #+END_SRC
** nix mode
   #+BEGIN_SRC emacs-lisp :results none
     (use-package nix-mode) 
   #+END_SRC
* undo tree
  #+BEGIN_SRC emacs-lisp :results none
    (use-package undo-tree) 
  #+END_SRC
* smart jump
  #+BEGIN_SRC emacs-lisp :results none
    (use-package smart-jump
      :ensure t
      :config
      (smart-jump-setup-default-registers))
  #+END_SRC
* beacon mode
  #+BEGIN_SRC emacs-lisp :results none
    (use-package beacon
      :config
      (beacon-mode))
  #+END_SRC
* COMMENT auto-sudoedit
  #+BEGIN_SRC emacs-lisp :results none
    (use-package auto-sudoedit
      :config
      (auto-sudoedit-mode 1))
  #+END_SRC
* rainbow delimitters
  #+BEGIN_SRC emacs-lisp :results none
    (use-package rainbow-delimiters
      :config
      (rainbow-delimiters-mode))
  #+END_SRC
* avy
  #+BEGIN_SRC emacs-lisp :results none
    (use-package avy)
  #+END_SRC
