config.html
<section>
<section id="slide-orgb6572e6">
<h2 id="orgb6572e6"><span class="section-number-2">35</span> tabs</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">setq-default</span> indent-tabs-mode nil)
(<span style="color: #00ffff;">setq-default</span> tab-width 2)
(<span style="color: #00ffff;">setq</span> indent-line-function 'insert-tab)
(<span style="color: #00ffff;">setq</span> tab-stop-list (number-sequence 2 200 2))
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orge835aea">
<h2 id="orge835aea"><span class="section-number-2">36</span> simple<sub>SRC</sub></h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">require</span> '<span style="color: #7fffd4;">generic-x</span>) <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">we need this</span>
(<span style="color: #00ffff;">define-generic-mode</span> 
      'simple-mode                         <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">name of the mode to create</span>
      '(<span style="color: #ffa07a;">"!!"</span>)                           <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">comments start with '!!'</span>
      '(<span style="color: #ffa07a;">"procedure"</span> <span style="color: #ffa07a;">"read"</span> <span style="color: #ffa07a;">"call"</span> <span style="color: #ffa07a;">"if"</span> <span style="color: #ffa07a;">"else"</span>)                     <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">some keywords</span>
      '((<span style="color: #ffa07a;">"="</span> . 'font-lock-operator)     <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">'=' is an operator</span>
        (<span style="color: #ffa07a;">";"</span> . 'font-lock-builtin))     <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">';' is a built-in </span>
      '(<span style="color: #ffa07a;">"\\.simple$"</span>)                      <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">files for which to activate this mode </span>
       nil                              <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">other functions to call</span>
      <span style="color: #ffa07a;">"A mode for simple files"</span>            <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">doc string for this mode</span>
    )
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgaa15f60">
<h2 id="orgaa15f60"><span class="section-number-2">37</span> pql</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">require</span> '<span style="color: #7fffd4;">generic-x</span>) <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">we need this</span>
(<span style="color: #00ffff;">define-generic-mode</span> 
      'pql-mode                         <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">name of the mode to create</span>
      '(<span style="color: #ffa07a;">"#"</span>)                           <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">comments start with '!!'</span>
      '(<span style="color: #ffa07a;">"program"</span> <span style="color: #ffa07a;">"procedure"</span> <span style="color: #ffa07a;">"stmt"</span> <span style="color: #ffa07a;">"assign"</span>
      <span style="color: #ffa07a;">"call"</span> <span style="color: #ffa07a;">"while"</span> <span style="color: #ffa07a;">"if"</span> <span style="color: #ffa07a;">"read"</span> <span style="color: #ffa07a;">"print"</span>
      <span style="color: #ffa07a;">"variable"</span> <span style="color: #ffa07a;">"then else"</span> <span style="color: #ffa07a;">"and"</span> <span style="color: #ffa07a;">"Select"</span> <span style="color: #ffa07a;">"such that"</span> <span style="color: #ffa07a;">"Calls"</span> <span style="color: #ffa07a;">"Next"</span> <span style="color: #ffa07a;">"Affects"</span>
      <span style="color: #ffa07a;">"Uses"</span> <span style="color: #ffa07a;">"UsesS"</span> <span style="color: #ffa07a;">"UsesP"</span> <span style="color: #ffa07a;">"Modifies"</span> <span style="color: #ffa07a;">"ModifiesS"</span> <span style="color: #ffa07a;">"ModifiesP"</span>)
      '((<span style="color: #ffa07a;">"="</span> . 'font-lock-operator)     <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">'=' is an operator</span>
        (<span style="color: #ffa07a;">";"</span> . 'font-lock-builtin))     <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">';' is a built-in </span>
      '(<span style="color: #ffa07a;">"\\.simple$"</span>)                      <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">files for which to activate this mode </span>
       nil                              <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">other functions to call</span>
      <span style="color: #ffa07a;">"A mode for simple files"</span>            <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">doc string for this mode</span>
    )
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org689cd09">
<h2 id="org689cd09"><span class="section-number-2">38</span> wgrep</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">wgrep</span>) 
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org721b205">
<h2 id="org721b205"><span class="section-number-2">39</span> base16</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">refresh-theme</span> ()
  (<span style="color: #00ffff;">interactive</span>)
  (<span style="color: #00ffff;">progn</span>
    (mapc #'disable-theme custom-enabled-themes)
    (load-theme 'base16 t))) 

(<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">base16-theme</span>
  <span style="color: #b0c4de;">:init</span>
  <span style="color: #b0c4de;">:config</span>
  (mapc #'disable-theme custom-enabled-themes)
  (load-theme 'base16-solarized-dark t)
  (mapc #'disable-theme custom-enabled-themes))
  <span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">(load-theme 'base16 t))</span>
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org0db8b22">
<h2 id="org0db8b22"><span class="section-number-2">40</span> transparency</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(set-frame-parameter (selected-frame) 'alpha '(95 . 85)) 
(add-to-list 'default-frame-alist '(alpha . (95 . 85)))
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orge9cff44">
<h2 id="orge9cff44"><span class="section-number-2">41</span> nix</h2>
<div class="outline-text-2" id="text-41">
</div>
</section>
<section id="slide-orgc541ded">
<h3 id="orgc541ded"><span class="section-number-3">41.1</span> nixos-options</h3>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">nixos-options</span>)
</pre>
</div>
</section>
<section id="slide-orge205445">
<h3 id="orge205445"><span class="section-number-3">41.2</span> nix mode</h3>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">nix-mode</span>) 
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orge92804f">
<h2 id="orge92804f"><span class="section-number-2">42</span> undo tree</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">undo-tree</span>) 
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orge00d012">
<h2 id="orge00d012"><span class="section-number-2">43</span> smart jump</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">smart-jump</span>
  <span style="color: #b0c4de;">:ensure</span> t
  <span style="color: #b0c4de;">:config</span>
  (smart-jump-setup-default-registers))
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org3bff123">
<h2 id="org3bff123"><span class="section-number-2">44</span> beacon mode</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">beacon</span>
  <span style="color: #b0c4de;">:config</span>
  (beacon-mode))
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgb6a5c72">
<h2 id="orgb6a5c72"><span class="section-number-2">45</span> rainbow delimitters</h2>
<div class="org-src-container">

<pre  class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> <span style="color: #7fffd4;">rainbow-delimiters</span>
  <span style="color: #b0c4de;">:config</span>
  (rainbow-delimiters-mode))
</pre>
</div>
</section>
</section>
